БухгалтерскиеЗадачиЗанятие4/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.ДвиженияДенежныхСредств</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПриобретениеТоваровИУслуг</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
    <items>
      <name>ДвиженияДенежныхСредств</name>
      <description>Движения денежных средств</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ДвиженияДенежныхСредств</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

БухгалтерскиеЗадачиЗанятие4/src/Constants/СкладскойУчет/ValueManagerModule.bsl
Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СкладскойУчет.Значение КАК Значение
				   |ИЗ
				   |	Константа.СкладскойУчет КАК СкладскойУчет";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	ДополнительныеСвойства.Вставить("ЗначениеДо", ВыборкаДетальныеЗаписи.Значение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СкладскойУчет.Значение КАК Значение
				   |ИЗ
				   |	Константа.СкладскойУчет КАК СкладскойУчет";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	ДополнительныеСвойства.Вставить("ЗначениеПосле", ВыборкаДетальныеЗаписи.Значение);
	
	Если ДополнительныеСвойства.ЗначениеПосле <> ДополнительныеСвойства.ЗначениеДо Тогда

		ОбновитьПовторноИспользуемыеЗначения();

		Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда
			ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
		Иначе
			ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Склады;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	СчетаВидыСубконто.Ссылка КАК Ссылка
					   |ИЗ
					   |	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
					   |ГДЕ
					   |	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";

		Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ПСОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

			Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда
				//Добавить
				Если ПСОбъект.ВидыСубконто.Количество() = 2 Тогда

					Продолжить;

				КонецЕсли;

				НоваяСтрока = ПСОбъект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Склады;

			Иначе
				//Удалить
				СтрокаДляУдаления = ПСОбъект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склады,
					"ВидСубконто");

				ПСОбъект.ВидыСубконто.Удалить(СтрокаДляУдаления);

			КонецЕсли;

			ПСОбъект.Записать();

		КонецЦикла;

	КонецЕсли;
КонецПроцедуры
